config.org
** Treesitter

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-treesitter.el
  ;; -*- lexical-binding: t; -*-

  (setq treesit-language-source-alist
        '((bash "https://github.com/tree-sitter/tree-sitter-bash")
          (c "https://github.com/tree-sitter/tree-sitter-c")
          (cmake "https://github.com/uyha/tree-sitter-cmake")
          (common-lisp "https://github.com/theHamsta/tree-sitter-commonlisp")
          (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (csharp "https://github.com/tree-sitter/tree-sitter-c-sharp")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (go-mod "https://github.com/camdencheek/tree-sitter-go-mod")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (js . ("https://github.com/tree-sitter/tree-sitter-javascript" "master" "src"))
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (lua "https://github.com/Azganoth/tree-sitter-lua")
          (make "https://github.com/alemuller/tree-sitter-make")
          (markdown "https://github.com/ikatyang/tree-sitter-markdown")
          (python "https://github.com/tree-sitter/tree-sitter-python")
          (r "https://github.com/r-lib/tree-sitter-r")
          (rust "https://github.com/tree-sitter/tree-sitter-rust")
          (toml "https://github.com/tree-sitter/tree-sitter-toml")
          (tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src"))
          (typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src"))
          (yaml "https://github.com/ikatyang/tree-sitter-yaml")))

  (setq treesit-load-name-override-list nil
        treesit-font-lock-level 4)

  (use-package treesit-auto
    :config
    (global-treesit-auto-mode))

  (provide 'init-treesitter)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-treesitter)
#+end_src

** Flymake Flycheck

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-flymake.el
  ;; -*- lexical-binding: t; -*-
  
  (use-package flymake-flycheck
    :bind (:map flymake-mode-map
                ("C-c ! l" . flymake-show-buffer-diagnostics)
                ("C-c ! n" . flymake-goto-next-error)
                ("C-c ! p" . flymake-goto-prev-error)
                ("C-c ! c" . flymake-start))
    :hook ((prog-mode     . flymake-mode)
           (text-mode     . flymake-mode)
           (flymake-mode  . (lambda ()
                              (setq-local flymake-diagnostic-functions
                                          (append flymake-diagnostic-functions
                                                  (flymake-flycheck-all-chained-diagnostic-functions)))))
           (flycheck-mode . (lambda ()
                              (setq-default flycheck-disabled-checkers
                                            (append (default-value 'flycheck-disabled-checkers)
                                                    '(emacs-lisp emacs-lisp-checkdoc emacs-lisp-package))))))
    :config
    (setq flymake-proc-allowed-file-name-masks nil))

  (provide 'init-flymake)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-flymake)
#+end_src

** Miscelaneous

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-misc.el
  ;; -*- lexical-binding: t; -*-

  (use-package info-colors
    :hook (Info-selection . info-colors-fontify-node))

  (use-package shfmt)

  (use-package dotenv-mode)

  (use-package crux
    :bind
    ([remap move-beginning-of-line] . crux-move-beginning-of-line)
    ([remap kill-whole-line]        . crux-kill-whole-line)
    ("C-<backspace>"                . crux-kill-line-backwards)
    ("C-S-o"                        . crux-smart-open-line-above)
    ("C-o"                          . crux-smart-open-line)
    ("C-c n"                        . crux-cleanup-buffer-or-region)
    ("C-c d"                        . crux-duplicate-current-line-or-region)
    ("C-c M-d"                      . crux-duplicate-and-comment-current-line-or-region)
    ("C-c r"                        . crux-rename-file-and-buffer)
    ("C-^"                          . crux-top-join-line)
    ("C-x C-u"                      . crux-upcase-region)
    ("C-x C-l"                      . crux-downcase-region)
    ("C-x M-c"                      . crux-capitalize-region))

  (use-package rainbow-delimiters
    :hook prog-mode)

  (provide 'init-misc)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-misc)
#+end_src

** Tramp

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-tramp.el
  (use-package ssh-deploy
    :after helm-tramp
    :hook ((after-save . ssh-deploy-after-save)
           (find-file . ssh-deploy-find-file))
    :config
    (ssh-deploy-line-mode)
    (ssh-deploy-add-menu))

  (setq remote-file-name-inhibit-cache nil)
  (setq tramp-verbose 6)
  (setq tramp-inline-compress-start-size 1000000)
  (setq tramp-default-method "ssh")

  (provide 'init-tramp)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-tramp)
#+end_src


** Shell

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-shell.el
  ;; -*- lexical-binding: t; -*-

  ;;(global-set-key (kbd "C-c e") 'eshell)

  (use-package eshell-prompt-extras
    :init
    (with-eval-after-load "esh-opt"
      (autoload 'epe-theme-lambda "eshell-prompt-extras")
      (setq eshell-highlight-prompt nil
            eshell-prompt-function 'epe-theme-lambda)))

  (use-package eshell-syntax-highlighting
    :config
    (eshell-syntax-highlighting-global-mode +1))

  (provide 'init-shell)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-shell)
#+end_src

** Folding

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-folding.el
  ;; -*- lexical-binding: t; -*-

  (use-package origami
    :bind (("C-c f" . origami-recursively-toggle-node)
           ("C-c F" . origami-toggle-all-nodes))
    :hook prog-mode)

  (provide 'init-folding)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-folding)
#+end_src

* Packages

** Dired

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-dired.el
  ;; -*- lexical-binding: t; -*-

  (require 'dired)
  (setq-default dired-dwim-target t)

  ;; Prefer g-prefixed coreutils version of standard utilities when available
  (let ((gls (executable-find "gls")))
    (when gls (setq insert-directory-program gls)))

  (use-package diredfl
    :config
    (diredfl-global-mode 1))

  (use-package dired-recent
    :init
    (dired-recent-mode 1))

  (use-package dired-hacks-utils
    :bind (:map dired-mode-map
                ("M-n" . dired-hacks-next-file)
                ("M-p" . dired-hacks-previous-file)))

  (use-package dired-filter
    :bind (:map dired-mode-map
                ("/" . dired-filter-mode)))

  (use-package dired-subtree
    :bind (:map dired-mode-map
                ("i" . dired-subtree-insert)
                (";" . dired-subtree-remove)))

  (use-package dired-narrow
    :bind (:map dired-mode-map
                ("s" . dired-narrow))
    :config
    (setq dired-narrow-exit-when-1-left nil))

  (provide 'init-dired)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-dired)
#+end_src

** Isearch

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-isearch.el
  ;; -*- lexical-binding: t; -*-

  (use-package anzu
    :bind (([remap query-replace-regexp] . anzu-query-replace-regexp)
           ([remap query-replace]        . anzu-query-replace)
           ("C-c a r"                    . anzu-query-replace-at-cursor)
           :map isearch-mode-map
           ([remap isearch-delete-char]  . isearch-del-char))
    :config
    (setq anzu-mode-lighter "")
    (global-anzu-mode +1))

  (provide 'init-isearch)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-isearch)
#+end_src

