config.org
** Helm Completion

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-helm.el
  ;; -*- lexical-binding: t; -*-

  (use-package helm
    :diminish helm-mode
    :bind (("C-x b"   . helm-mini)
           ("M-x"     . helm-M-x)
           ("C-x C-f" . helm-find-files)
           ("M-y"     . helm-show-kill-ring)
           ("<f1> f"  . helm-apropos)
           ("C-c o"   . helm-imenu)
           ("C-c b"   . helm-bookmarks)
           ("C-c t"   . helm-themes)
           ("<f1> l"  . helm-locate-library)
           :map helm-find-files-map
           ("C-c C-i" . helm-ff-properties-persistent))
    :config
    (setq helm-M-x-fuzzy-match                  t
          helm-buffers-fuzzy-matching           t
          helm-recentf-fuzzy-match              t
          helm-locate-fuzzy-match               t
          helm-candidate-number-limit           200
          helm-split-window-inside-p            t
          helm-always-two-windows               nil
          helm-display-buffer-default-height    15
          helm-move-to-line-cycle-in-source     t
          helm-autoresize-max-height            40
          helm-autoresize-min-height            20
          helm-M-x-show-short-doc               t
          helm-default-display-buffer-functions '(display-buffer-in-side-window)
          helm-boring-buffer-regexp-list        '("\\*copilot-balancer\\*"
                                                  "\\*straight-process\\*"
                                                  "\\*code-conv\\*"))
    (helm-mode 1)
    (helm-autoresize-mode 1))

  (use-package helm-projectile
    :after (helm projectile)
    :config
    (helm-projectile-on)
    :bind (("C-c p h" . helm-projectile)
           ("C-c p p" . helm-projectile-switch-project)
           ("C-c p f" . helm-projectile-find-file)
           ("C-c p g" . helm-projectile-grep)))

  (use-package helm-git-grep
    :after helm
    :bind (("C-c g" . helm-git-grep)
           ("C-c G" . helm-git-grep-at-point))
    :config
    (setq helm-git-grep-include-submodules t)
    (setq helm-git-grep-use-iomenu-last-pattern t))

  (use-package helm-ls-git
    :bind (("M-g G" . helm-browse-project)
           ("M-g H" . helm-projects-history)))

  (use-package helm-gitignore
    :after helm)

  (use-package helm-themes
    :after helm)

  (use-package helm-swoop
    :after helm
    :bind (("M-i"     . helm-swoop)
           ("M-I"     . helm-swoop-back-to-last-point)
           ("C-c M-i" . helm-multi-swoop)
           ("C-x M-i" . helm-multi-swoop-all)
           :map isearch-mode-map
           ("M-i"     . helm-swoop-from-isearch)
           :map helm-swoop-map
           ("M-i"     . helm-multi-swoop-all-from-helm-swoop)
           ("M-m"     . helm-multi-swoop-current-mode-from-helm-swoop)
           ("C-r"     . helm-previous-line)
           ("C-s"     . helm-next-line)
           ("C-r"     . helm-previous-line)
           ("C-s"     . helm-next-line))
    :config
    (setq helm-multi-swoop-edit-save t
          helm-swoop-split-with-multiple-windows nil
          helm-swoop-split-direction 'split-window-vertically
          helm-swoop-speed-or-color nil
          helm-swoop-move-to-line-cycle t
          helm-swoop-use-line-number-face t
          helm-swoop-use-fuzzy-match t))

  (use-package helm-rg
    :after helm
    :bind ("C-c k" . helm-rg))

  (use-package helm-mt
    :after helm
    :bind (("C-x T" . helm-mt))
    :config
    (helm-mt/reroute-terminal-functions t))

  (use-package helm-tramp
    :after helm
    :bind (("C-c s" . helm-tramp))
    ;; :hook ((helm-tramp-pre-command . '(lambda ()
    ;;                                     (global-aggressive-indent-mode 0)
    ;;                                     (projectile-mode 0)
    ;;                                     (editorconfig-mode 0)))
    ;;        (helm-tramp-quit        . '(lambda ()
    ;;                                     (global-aggressive-indent-mode 1)
    ;;                                     (projectile-mode 1)
    ;; (editorconfig-mode 1))))
    )

  (use-package helm-make
    :after helm
    :bind ("C-c c" . helm-make-projectile))

  (use-package helm-descbinds
    :after helm
    :bind ("<f2> D" . helm-descbinds))

  (provide 'init-helm)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-helm)
#+end_src

** Ivy Completion

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-ivy.el
  ;; -*- lexical-binding: t; -*-

  (use-package ivy
    :diminish ivy-mode
    :bind (("C-x b" . ivy-switch-buffer)
           ("C-c v" . ivy-push-view)
           ("C-c V" . ivy-pop-view))
    :config
    (setq ivy-use-virtual-buffers        t
          ivy-count-format               "(%d/%d) "
          ivy-display-style              'fancy
          ivy-initial-inputs-alist       nil
          enable-recursive-minibuffers   t
          ivy-wrap t)
    (ivy-mode 1))

  (use-package ivy-rich
    :config
    (ivy-rich-modify-column
     'ivy-switch-buffer
     'ivy-rich-switch-buffer-major-mode
     '(:width 20 :face error))
    (ivy-rich-mode 1))

  (use-package counsel
    :bind (("M-x"     . counsel-M-x)
           ("C-x C-f" . counsel-find-file)
           ("M-y"     . counsel-yank-pop)
           ("<f1> f"  . counsel-describe-function)
           ("<f1> v"  . counsel-describe-variable)
           ("<f1> l"  . counsel-find-library)
           ("<f2> i"  . counsel-info-lookup-symbol)
           ("<f2> u"  . counsel-unicode-char)
           ("<f2> j"  . counsel-set-variable)

           ;; Ivy-based interface to shell and system tools
           ("C-c c"   . counsel-compile)
           ("C-c g"   . counsel-git)
           ("C-c j"   . counsel-git-grep)
           ("C-c L"   . counsel-git-log)
           ("C-c k"   . counsel-rg)
           ("C-x l"   . counsel-locate)
           ("C-c J"   . counsel-file-jump)

           ;; Ivy-resume and other commands
           ("C-c C-r" . ivy-resume)
           ("C-c b"   . counsel-bookmark)
           ("C-c D"   . counsel-descbinds)
           ("C-c o"   . counsel-outline)
           ("C-c t"   . counsel-load-theme)
           ("C-c F"   . counsel-org-file)))

  (use-package marginalia
    :bind (:map minibuffer-local-map
                ("M-A" . marginalia-cycle))
    :init
    (marginalia-mode))

  (provide 'init-ivy)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;;(require 'init-ivy)
#+end_src

** Which Key

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-which-key.el
  ;; -*- lexical-binding: t; -*-

  (use-package which-key
    :diminish which-key-mode
    :config
    (which-key-mode))

  (provide 'init-which-key)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-which-key)
#+end_src

** Projectile

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-projectile.el
  ;; -*- lexical-binding: t; -*-

  (use-package projectile
    :bind (:map projectile-mode-map
                ("C-c p" . projectile-command-map))
    :config
    (setq projectile-indexing-method                'alien
          projectile-sort-order                     'modification-time
          projectile-enable-caching                 t
          projectile-per-project-compilation-buffer t
          projectile-mode-line-function             '(lambda ()
                                                       (format " Proj[%s]"
                                                               (projectile-project-name))))
     (projectile-mode +1))
  
  (use-package projectile-git-autofetch
    :diminish projectile-git-autofetch-mode
    :config
    (projectile-git-autofetch-mode 1))

  (provide 'init-projectile)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-projectile)
#+end_src

** Grep

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-grep.el
  ;; -*- lexical-binding: t; -*-

  (setq-default grep-highlight-matches t
                grep-scroll-output t)

  (when *is-a-mac*
    (setq-default locate-command "mdfind"))

  (use-package wgrep
    :bind (:map grep-mode-map
           ("C-c C-q" . wgrep-change-to-wgrep-mode)))

  (use-package deadgrep
    :bind ("<f5>" . deadgrep))

  (provide 'init-grep)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-grep)
#+end_src

** Corfu

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-corfu.el
  ;; -*- lexical-binding: t; -*-

  (use-package corfu
    :hook
    ((shell-mode  . (lambda () (setq-local corfu-auto nil)))
     (eshell-mode . (lambda () (setq-local corfu-auto nil)))
     (term-mode   . (lambda () (setq-local corfu-auto nil)))
     (after-init  . global-corfu-mode))
    :custom
    (corfu-cycle t)
    (corfu-auto t) 
    (corfu-commit-predicate nil)
    (corfu-quit-no-match t)
    (corfu-auto-delay 0)
    (corfu-auto-prefix 1)
    :bind (:map corfu-map
                ("TAB" . corfu-next)
                ([tab] . corfu-next)
                ("S-TAB" . corfu-previous)
                ([backtab] . corfu-previous)
                ("RET" . corfu-insert)
                ([return] . corfu-insert)))

  (provide 'init-corfu)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-corfu)
#+end_src

** Embark

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-embark.el
  ;; -*- lexical-binding: t; -*-

  (use-package embark
    :bind (("C-." . embark-act)
           ("C-;" . embark-dwim)
           ("C-h B" . embark-bindings)))

  (provide 'init-embark)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-embark)
#+end_src

** Eglot

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-eglot.el
  ;; -*- lexical-binding: t; -*-

  (require 'eglot)

  (setq read-process-output-max (* 3 1024 1024))
  
  ;; Default of 800 was too low.
  ;; Avoid Lisp nesting exceeding in swift-mode.
  (setq max-lisp-eval-depth 10000)
  (setq max-specpdl-size 10000)

  (provide 'init-eglot)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-eglot)
#+end_src

** Windows

Ace Window Config
Remember:
x - delete window
m - swap windows
M - move window
c - copy window
j - select buffer
n - select the previous window
u - select buffer in the other window
c - split window fairly, either vertically or horizontally
v - split window vertically
b - split window horizontally
o - maximize current window
? - show these command bindings

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-windows.el
  ;; -*- lexical-binding: t; -*-

  (use-package winner-mode
    :straight nil
    :hook after-init)

  (use-package ace-window
    :bind ("M-o" . ace-window)
    :config
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

  (provide 'init-windows)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-windows)
#+end_src

** Git

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-git.el
  ;; -*- lexical-binding: t; -*-

  (use-package git-modes)

  (use-package git-timemachine
    :bind ("C-x v t" . git-timemachine-toggle))

  (use-package magit
    :bind
    (([(meta f12)] . magit-status)
     ("C-x g"      . magit-status)
     ("C-x M-g"    . magit-dispatch))
    :hook (magit-mode . (lambda () (local-unset-key [(meta h)])))
    :config
    (setq-default magit-diff-refine-hunk 'all))

  (use-package forge
    :after magit)

  (use-package diff-hl
    :hook ((dired-mode         . diff-hl-dired-mode)
           (magit-post-refresh . diff-hl-magit-post-refresh)
           (after-init         . global-diff-hl-mode))
    :bind (:map diff-hl-mode-map
                ("<left-fringe> <mouse-1>" . diff-hl-diff-goto-hunk)))

  (provide 'init-git)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-git)
#+end_src

