config.org
** ORG MODE

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-org.el
  ;; -*- lexical-binding: t; -*-

  (use-package org)

  (use-package org-modern
    :config
    (setq
     ;; Edit settings
     org-auto-align-tags nil
     org-tags-column 0
     org-catch-invisible-edits 'show-and-error
     org-special-ctrl-a/e t
     org-insert-heading-respect-content t
     
     ;; Org styling, hide markup etc.
     org-hide-emphasis-markers t
     org-pretty-entities t
     org-ellipsis "…"
     
     ;; Agenda styling
     org-agenda-tags-column 0
     org-agenda-block-separator ?─
     org-agenda-time-grid
     '((daily today require-timed)
       (800 1000 1200 1400 1600 1800 2000)
       " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
     org-agenda-current-time-string
     "⭠ now ─────────────────────────────────────────────────")
    
    (global-org-modern-mode))

  (use-package org-wc
    :after org)

  (use-package org-pomodoro
    :after org)

  (use-package org-zettelkasten
    :hook org-mode)

  (use-package org-super-agenda
    :after org-agenda
    :config
    (setq org-agenda-files '("~/org/agenda/agenda.org"
                             "~/org/agenda/sessione.org"))
    (setq org-super-agenda-groups
          '((:name "Oggi"
                   :time-grid t
                   :scheduled today)
            (:name "Importante"
                   :priority "A")))
    (org-super-agenda-mode))

  (provide 'init-org)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-org)
#+end_src

** Yasnippet

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-yasnippet.el
  (use-package yasnippet
    :diminish yasnippet
    :bind (:map  yas-minor-mode-map
                 ("<backtab>" . yas-expand))
    :config
    ;;(setq yas-snippet-dirs '("~/.emacs.d/personal-snippets"))
    (yas-global-mode 1))

  (use-package yasnippet-snippets
    :after yasnippet)

  (use-package helm-c-yasnippet
    :after (yasnippet helm)
    :bind (("C-c Y" . helm-yas-complete)
           ("<f6>"  . helm-yas-visit-snippet-file))
    :config
    (setq helm-yas-space-match-any-greedy t))


  (provide 'init-yasnippet)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-yasnippet)
#+end_src

* Languages

** Dart

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-dart.el
  ;; -*- lexical-binding: t; -*-

  (use-package dart-mode
    :bind (:map dart-mode-map
                ("C-M-x" . flutter-run-or-hot-reload)))

  (use-package flutter
    :config
    (setq flutter-sdk-path "~/FlutterDev/flutter/"))

  (provide 'init-dart)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-dart)
#+end_src

** C/C++

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-cxx.el
  
  (defvar +cc-default-compiler-options
    `((c-mode . nil)
      (c++-mode
       . ,(list "-std=c++17" ; use C++17 draft by default
                (when *is-a-mac*
                  ;; NOTE beware: you'll get abi-inconsistencies when passing
                  ;; std-objects to libraries linked with libstdc++ (e.g. if you
                  ;; use boost which wasn't compiled with libc++)
                  "-stdlib=libc++")))
      (objc-mode . nil))
    "A list of default compiler options for the C family. These are ignored if a
  compilation database is present in the project.")

  (use-package modern-cpp-font-lock
    :hook (c++-mode . modern-c++-font-lock-mode))

  (use-package disaster)

  (use-package cmake-mode)

  (use-package flycheck-clang-analyzer
    :after flycheck
    :hook (c++-ts-mode . (lambda () (setq flycheck-clang-language-standard "c++17")))
    :config (flycheck-clang-analyzer-setup))

  (provide 'init-cxx)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-cxx)
#+end_src
